---
title: OverlapFailures
classe: Autodesk.Revit.DB.BuiltInFailures+OverlapFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 21
---

# OverlapFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AreaBoundaryLinesOverlap { get; }` | `OverlapFailures.AreaBoundaryLinesOverlap` | FailureDefinitionId |
| `FailureDefinitionId CurvesOverlap { get; }` | `OverlapFailures.CurvesOverlap` | FailureDefinitionId |
| `FailureDefinitionId DivisionSketchOverlap { get; }` | `OverlapFailures.DivisionSketchOverlap` | FailureDefinitionId |
| `FailureDefinitionId DuplicateFabricSheet { get; }` | `OverlapFailures.DuplicateFabricSheet` | FailureDefinitionId |
| `FailureDefinitionId DuplicateInstances { get; }` | `OverlapFailures.DuplicateInstances` | FailureDefinitionId |
| `FailureDefinitionId DuplicatePoints { get; }` | `OverlapFailures.DuplicatePoints` | FailureDefinitionId |
| `FailureDefinitionId DuplicateRebar { get; }` | `OverlapFailures.DuplicateRebar` | FailureDefinitionId |
| `FailureDefinitionId ELASeparationLinesOverlap { get; }` | `OverlapFailures.ELASeparationLinesOverlap` | FailureDefinitionId |
| `FailureDefinitionId FloorsOverlap { get; }` | `OverlapFailures.FloorsOverlap` | FailureDefinitionId |
| `FailureDefinitionId LevelsOverlap { get; }` | `OverlapFailures.LevelsOverlap` | FailureDefinitionId |
| `FailureDefinitionId OverlappingElementsTest { get; }` | `OverlapFailures.OverlappingElementsTest` | FailureDefinitionId |
| `FailureDefinitionId RoomSeparationLinesOverlap { get; }` | `OverlapFailures.RoomSeparationLinesOverlap` | FailureDefinitionId |
| `FailureDefinitionId SpaceSeparationLinesOverlap { get; }` | `OverlapFailures.SpaceSeparationLinesOverlap` | FailureDefinitionId |
| `FailureDefinitionId SubregionOverlap { get; }` | `OverlapFailures.SubregionOverlap` | FailureDefinitionId |
| `FailureDefinitionId ToposolidFloorOverlap { get; }` | `OverlapFailures.ToposolidFloorOverlap` | FailureDefinitionId |
| `FailureDefinitionId ToposolidOverlap { get; }` | `OverlapFailures.ToposolidOverlap` | FailureDefinitionId |
| `FailureDefinitionId ToposolidSubregionOverlap { get; }` | `OverlapFailures.ToposolidSubregionOverlap` | FailureDefinitionId |
| `FailureDefinitionId WallAreaBoundaryOverlap { get; }` | `OverlapFailures.WallAreaBoundaryOverlap` | FailureDefinitionId |
| `FailureDefinitionId WallRoomSeparationOverlap { get; }` | `OverlapFailures.WallRoomSeparationOverlap` | FailureDefinitionId |
| `FailureDefinitionId WallsOverlap { get; }` | `OverlapFailures.WallsOverlap` | FailureDefinitionId |
| `FailureDefinitionId WallSpaceSeparationOverlap { get; }` | `OverlapFailures.WallSpaceSeparationOverlap` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```